vertical-pod-autoscaler/experiments/sn-pbr-throughput/2plus/home.log
Running 15m test @ http://10.107.81.244:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 5.514ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 635.771ms, rate sampling interval: 6733ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.94m     2.19m    9.97m    73.93%
    Req/Sec    13.92     31.63   133.00     81.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.04m 
 75.000%    7.51m 
 90.000%    8.53m 
 99.000%    9.97m 
 99.900%   10.28m 
 99.990%   10.33m 
 99.999%   10.33m 
100.000%   10.33m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.009     0.000000            1         1.00
  163971.071     0.100000         2040         1.11
  259915.775     0.200000         4103         1.25
  312475.647     0.300000         6120         1.43
  329252.863     0.400000         8271         1.67
  362283.007     0.500000        10204         2.00
  390070.271     0.550000        11224         2.22
  409731.071     0.600000        12239         2.50
  423886.847     0.650000        13266         2.86
  438042.623     0.700000        14300         3.33
  450363.391     0.750000        15306         4.00
  457965.567     0.775000        15816         4.44
  474218.495     0.800000        16322         5.00
  477888.511     0.825000        16873         5.71
  478937.087     0.850000        17354         6.67
  482607.103     0.875000        17846         8.00
  495714.303     0.887500        18103         8.89
  511967.231     0.900000        18356        10.00
  522452.991     0.912500        18611        11.43
  532414.463     0.925000        18877        13.33
  545259.519     0.937500        19124        16.00
  553123.839     0.943750        19249        17.78
  562036.735     0.950000        19376        20.00
  568328.191     0.956250        19514        22.86
  573046.783     0.962500        19638        26.67
  577765.375     0.968750        19768        32.00
  579862.527     0.971875        19826        35.56
  582483.967     0.975000        19897        40.00
  584581.119     0.978125        19958        45.71
  587726.847     0.981250        20022        53.33
  591396.863     0.984375        20083        64.00
  592969.727     0.985938        20112        71.11
  595066.879     0.987500        20145        80.00
  597164.031     0.989062        20178        91.43
  599261.183     0.990625        20208       106.67
  601882.623     0.992188        20236       128.00
  603455.487     0.992969        20255       142.22
  604504.063     0.993750        20268       160.00
  605552.639     0.994531        20287       182.86
  606601.215     0.995313        20300       213.33
  608174.079     0.996094        20323       256.00
  608698.367     0.996484        20327       284.44
  609746.943     0.996875        20334       320.00
  610795.519     0.997266        20341       365.71
  612368.383     0.997656        20348       426.67
  613416.959     0.998047        20356       512.00
  614465.535     0.998242        20362       568.89
  614989.823     0.998437        20364       640.00
  616038.399     0.998633        20370       731.43
  616562.687     0.998828        20373       853.33
  617611.263     0.999023        20379      1024.00
  617611.263     0.999121        20379      1137.78
  618135.551     0.999219        20382      1280.00
  618135.551     0.999316        20382      1462.86
  618659.839     0.999414        20388      1706.67
  618659.839     0.999512        20388      2048.00
  618659.839     0.999561        20388      2275.56
  618659.839     0.999609        20388      2560.00
  619184.127     0.999658        20390      2925.71
  619184.127     0.999707        20390      3413.33
  619708.415     0.999756        20395      4096.00
  619708.415     1.000000        20395          inf
#[Mean    =   356577.857, StdDeviation   =   131290.440]
#[Max     =   619184.128, Total count    =        20395]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20944 requests in 15.00m, 183.93MB read
  Socket errors: connect 0, read 0, write 10, timeout 656
  Non-2xx or 3xx responses: 1
Requests/sec:     23.27
Transfer/sec:    209.26KB